Билет14/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопСведенья</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗначенияДопСведений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Билет14/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДопРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Билет14/Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	ОбновитьДопРеквизиты(Объект.Менеджер);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьДопРеквизиты(Объект.Менеджер);
КонецПроцедуры

&НаСервере
Процедура ОбновитьДопРеквизиты(Менеджер)
	
	ДобавляемыеРеквизиты	= Новый Массив;
	УдаляемыеРеквизиты		= Новый Массив;
	
	Префикс	= "ДопРеквизит_";
	ТекущиеРеквизиты		= ПолучитьРеквизиты();
	
	Для каждого РеквФормы Из ТекущиеРеквизиты Цикл
		Если СтрНайти(РеквФормы.Имя, Префикс) > 0 Тогда
			УдаляемыеРеквизиты.Добавить(РеквФормы.Имя); 
			УдаляемыйЭлемент	= Элементы.Найти(РеквФормы.Имя);
			Если УдаляемыйЭлемент <> Неопределено Тогда
				Элементы.Удалить(УдаляемыйЭлемент);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	""ДопРеквизит_"" + ФизическиеЛицаДопРеквизиты.Свойство.Код КАК Имя,
		|	ФизическиеЛицаДопРеквизиты.Свойство.Наименование КАК Заголовок,
		|	ФизическиеЛицаДопРеквизиты.Свойство.ТипЗначения КАК Тип,
		|	ЕСТЬNULL(КонтрагентыДопСведенья.Значение, НЕОПРЕДЕЛЕНО) КАК Значение,
		|	ФизическиеЛицаДопРеквизиты.Свойство КАК Свойство
		|ИЗ
		|	Справочник.ФизическиеЛица.ДопРеквизиты КАК ФизическиеЛицаДопРеквизиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДопСведенья КАК КонтрагентыДопСведенья
		|		ПО ФизическиеЛицаДопРеквизиты.Ссылка = КонтрагентыДопСведенья.Ссылка.Менеджер
		|			И ФизическиеЛицаДопРеквизиты.Свойство = КонтрагентыДопСведенья.Свойство
		|ГДЕ
		|	ФизическиеЛицаДопРеквизиты.Ссылка = &Менеджер";
	
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка	= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовРеквизит	= Новый РеквизитФормы(Выборка.Имя, Выборка.Тип, , Выборка.Заголовок);
	    ДобавляемыеРеквизиты.Добавить(НовРеквизит);
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		НовЭлемент				= Элементы.Добавить(Выборка.Имя, Тип("ПолеФормы"), ЭтаФорма); 
		НовЭлемент.Вид			= ВидПоляФормы.ПолеВвода;
		НовЭлемент.ПутьКДанным	= Выборка.Имя;		
		
		МассивПараметров		= Новый Массив;
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Выборка.Свойство));
		НовЭлемент.ПараметрыВыбора	= Новый ФиксированныйМассив(МассивПараметров);
		
		ЭтотОбъект[Выборка.Имя]	= Выборка.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДопСведенья.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛицаДопРеквизиты.Свойство КАК Свойство,
		|	""ДопРеквизит_"" + ФизическиеЛицаДопРеквизиты.Свойство.Код КАК Имя
		|ИЗ
		|	Справочник.ФизическиеЛица.ДопРеквизиты КАК ФизическиеЛицаДопРеквизиты
		|ГДЕ
		|	ФизическиеЛицаДопРеквизиты.Ссылка = &Менеджер";
	
	Запрос.УстановитьПараметр("Менеджер", ТекущийОбъект.Менеджер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка	= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗначениеРевизита	= ЭтотОбъект[Выборка.Имя];
		Если ЗначениеЗаполнено(ЗначениеРевизита) Тогда
			НовДопРекв	= ТекущийОбъект.ДопСведенья.Добавить();
			НовДопРекв.Свойство	= Выборка.Свойство;
			НовДопРекв.Значение	= ЗначениеРевизита;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
